//
//  PredictionViewModel.swift
//  Tarot
//
//  Created by Dmitryi Velko on 15.07.2023.
//

import Foundation

final class PredictionViewModel: ObservableObject {
    @Published var predictionText: String = """
Понимание ваших карьерных перспектив может быть сложной задачей, но я с радостью помогу вам найти некоторые указания и руководство с помощью таро.
                         
Первая карта, которую я раскрою, это Влюбленные. Она символизирует страсть, гармонию и выбор. Это может указывать на то, что ваши карьерные перспективы связаны с чем-то, что вызывает в вас страсть и эмоциональное вовлечение. Размышлите о том, какие области или проекты вызывают у вас наибольший интерес и вдохновение.

Вторая карта — Император. Она представляет авторитет, стабильность и руководство. Это указывает на то, что у вас есть потенциал стать лидером и принимать важные решения в вашей карьере. Развивайте свои управленческие и организационные навыки, чтобы эффективно использовать ваш потенциал.

Третья карта — Колесо Фортуны. Она указывает на постоянные изменения и возможности. Ваши карьерные перспективы могут подразумевать периоды изменений и роста, где вы будете иметь возможность исследовать новые направления и преодолевать препятствия.

Все эти карты указывают на то, что у вас есть потенциал для успешной и стимулирующей карьеры. Важно следовать своим страстям и находить области, которые вас вдохновляют. Развивайте лидерские качества и принимайте решения, которые помогут вам продвинуться вперед. Будьте готовы к изменениям и открытыми для новых возможностей, которые могут появиться на вашем пути.

 Помните, что Таро предлагает указания и руководство, но окончательные решения и действия остаются за вами. Ваши карьерные перспективы зависят от множества факторов, включая ваши усилия, навыки, обстоятельства и возможности. Будьте настойчивыми, готовыми к росту и готовыми принять вызовы, которые предстоят в вашей карьере.

Я желаю вам успехов в достижении ваших карьерных целей и надеюсь, что эти указания помогут вам на вашем пути. Если у вас есть еще вопросы, пожалуйста, не стесняйтесь задавать!
"""
}
